//=============================================================================
//!
//!	@file	KeyInput.cpp
//!	@brief	キーデータ
//!
//!	@author	YKCH
//!
//=============================================================================
#include "stdafx.h"

//-----------------------------------------------------------------------------
//!	コンストラクタ
//-----------------------------------------------------------------------------
KeyInputManager::KeyInputManager()
{
	for(u32 i = 0; i < 8; ++i)
	{
		_buttons[i] = 0;
		_triggers[i] = 0;
		_releases[i] = 0;
	}
}

//-----------------------------------------------------------------------------
//!	デストラクタ
//-----------------------------------------------------------------------------
KeyInputManager::~KeyInputManager()
{
}

//-----------------------------------------------------------------------------
//!	更新
//-----------------------------------------------------------------------------
void KeyInputManager::Update()
{
	//	キーデータ取得
	u8 key[256];
	if(GetKeyboardState(key) == FALSE)
	{
		DEBUG_LOG("キーデータ取得失敗");
	}

	for(u32 i = 0; i < 8; ++i)
	{
		u32 buttons = 0;
		u32 oldButtons = _buttons[i];
		u32 start = i * 32;
		for(u32 j = 0; j < 32; ++j)
		{
			if(key[j + start] & 0x80)
			{
				buttons |= (1 << j);
			}
		}
		_buttons[i] = buttons;
		_triggers[i] = (buttons ^ oldButtons) & buttons;
		_releases[i] = (buttons ^ oldButtons) & oldButtons;

	}
}

