//=============================================================================
//!
//!	@file	PointObject.h
//!	@brief	座標情報のみオブジェクト
//!
//!	@author	YKCH
//!
//=============================================================================
#pragma once

//-------------------------------------------------------------------
//! @brief  座標情報のみオブジェクト
//-------------------------------------------------------------------
class PointObject : public GameObjectBase
{
public:
	//! @brief  コンストラクタ
	PointObject(){}

	//! @brief  デストラクタ
	virtual ~PointObject(){}
};

